src/InformationRegisters/СтатусыДоставки/СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </resources>
  <attributes>
    <name>ОриентеровачнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыОперацийСчетКонтрагента/ВидыОперацийСчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСчетКонтрагента</name>
  <enumValues>
    <name>СТранспортнойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>СЭкспедиторскойКомпанией</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыОтправкиГруза/СтатусыОтправкиГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиГруза</name>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>СформирванаЗаявкаВТК</name>
  </enumValues>
  <enumValues>
    <name>ВыехалСТочки</name>
  </enumValues>
  <enumValues>
    <name>ВТранспортнойКомпании</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленСчетЭК</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПолучения</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОперацийОтчетОДоставке/ВидыОперацийОтчетОДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийОтчетОДоставке</name>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаВТранспортнуюКомпанию/ЗаявкаВТранспортнуюКомпанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаВТранспортнуюКомпанию</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/СПКонтрольДоставкиГрузов/Module.bsl
Процедура ПроверитьУникальностьСтатусаДляГруза(ДокументОбъект, Отказ)  Экспорт
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.СчетКонтрагента") 		и ДокументОбъект.видОперации=Перечисления.ВидыОперацийСчетКонтрагента.СЭкспедиторскойКомпанией Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.ДобавленСчетЭК;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.СчетКонтрагента")  и ДокументОбъект.видОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.ВТранспортнойКомпании;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ОтчетОДоставке")   и ДокументОбъект.видОперации=Перечисления.ВидыОперацийОтчетОДоставке.Доставлен Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.Доставлен;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ОтчетОДоставке")   и ДокументОбъект.видОперации=Перечисления.ВидыОперацийОтчетОДоставке.Утрачен Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.Утрачен;
	ИначеЕсли ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ЗаявкаВТранспортнуюКомпанию") Тогда
		Статус=Перечисления.СтатусыОтправкиГруза.СформирванаЗаявкаВТК;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыДоставки.Груз,
		|	СтатусыДоставки.Регистратор
		|ИЗ
		|	РегистрСведений.СтатусыДоставки КАК СтатусыДоставки
		|ГДЕ
		|	СтатусыДоставки.Статус = &Статус
		|	И СтатусыДоставки.Регистратор <> &Регистратор
		|	И СтатусыДоставки.Груз В(&Груз)";
	
	Запрос.УстановитьПараметр("Груз", ДокументОбъект.Заказы.ВыгрузитьКолонку("Груз"));
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стр=ДокументОбъект.Заказы.Найти(Выборка.Груз,"Груз");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для "+Выборка.груз+" уже установлен статус: """+Статус+""", документом: "+Выборка.Регистратор,Выборка.Регистратор,"Заказы["+(стр.номерстроки-1)+"].Груз",,Отказ);	
	КонецЦикла;
КонецПроцедуры	

Процедура ЗаполнитьЗаявкиПоКоробкам(ДокОбъект,ТЧ,Колонка) Экспорт
	
	ТЗКоробок=ДокОбъект[ТЧ].Выгрузить(); 
	ТЗКоробок.колонки[Колонка].Имя="Груз";
	ТЗКоробок.Свернуть("Груз");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.Груз
		|ПОМЕСТИТЬ ТЗКоробок
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗКоробок.Груз,
		|	ЕСТЬNULL(ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка)) КАК Заявка
		| ИЗ
		|	ТЗКоробок КАК ТЗКоробок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаВТранспортнуюКомпанию.Заказы КАК ЗаявкаВТранспортнуюКомпаниюЗаказы
		|		ПО ТЗКоробок.Груз = ЗаявкаВТранспортнуюКомпаниюЗаказы.Груз
		|			И (ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка.Проведен)";
	Запрос.Параметры.Вставить("ВТ",ТЗКоробок);
	
	РезультатЗапроса = Запрос.Выполнить();
	тз=РезультатЗапроса.Выгрузить();
	Для каждого стр из ДокОбъект[ТЧ] Цикл
		МассивСтрок=тз.НайтиСтроки(новый Структура("Груз",стр[Колонка]));
		Если МассивСтрок.Количество()>0 Тогда
			стр.Заявка=МассивСтрок[0].Заявка;
		Иначе
			стр.Заявка=Документы.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;	
	тз.Свернуть("Заявка");
	ДокОбъект.ЗаявкиВТК.Загрузить(ТЗ);
КонецПроцедуры
